---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BeamDirectionNotSpecified
source: html/d242394f-264d-b25c-6e95-a49e98cfed09.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BeamDirectionNotSpecified Property

Beam direction not specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId BeamDirectionNotSpecified { get; }
```